#!/usr/bin/env python3
# -*- coding: utf-8 -*-
a = float(input('Введите первый катет: '))
b = float(input('Введите второй катет: '))
s = a * b / 2
print(a, b, s)
# Очень древний способ печати
print('Площадь с %7.3f и %7.3f равна %10.4f' % (a, b, s))
# Очень древний способ печати
txt = 'Площадь с %7.3f и %7.3f равна %10.4f' % (a, b, s)
print(txt)

# Древний способ печати
print('Площадь с {0:7.3f} и {1:7.3f} равна {2:10.4f}'.format(a, b, s))

# Современный способ печати с Python 3.6
print(f'Площадь с {a:7.3f} и {b:7.3f} равна {s:10.4f}')
t = f'Площадь с {a:7.3f} и {b:7.3f} равна {a*b/2:10.4f} {(a+b)*2}'
print(t)

# Новейший способ печати с Python 3.8
print(f'Площадь с {a = :7.3f} и b = {b=:7.3f} равна {s    =:10.4f}')

print('END')