#!/usr/bin/env python3
# -*- coding: utf-8 -*-
'''Пользователь вводит список чисел, разделённых несколькими
пробелами в несколько строк до ввода пустой строки или строки,
состоящей из одних пробелов. Выведите из этого единого списка
все элементы, которые больше двух своих соседей и количество
таких элементов. Крайние элементы никогда не учитываются,
поскольку у них недостаточно соседей.'''
#    52  752  34  78545   5214 245
#   11  5646    83443   523    752
#      2
#
# 52 752 34 78545 5214 245 11  5646 83443 523  752  2
#    752    78545                   83443      752
# Всего 4 элемента: 752 78545 83443 752



print('END')
